#+TITLE: Single group analysis with repeated measurements
#+Author: 

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
options(width = 100)
setwd("c:/Users/hpl802/Documents/Github/bozenne.github.io/doc/2024_02_27-RManova/")
#+END_SRC

#+RESULTS:

Load packages
#+BEGIN_SRC R :exports both :results silent :session *R* :cache no
library(LMMstar)
library(lme4)
library(lmerTest)
library(ggplot2)
#+END_SRC

Load data and add 'artificial' sex variable and remove some variables:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
data(gastricbypassW)
gastricbypassW$weight2 <- NULL
gastricbypassW$weight3 <- NULL
gastricbypassW$weight4 <- NULL
gastricbypassW$male <- as.numeric(gastricbypassW$id) %% 2
head(gastricbypassW)
#+END_SRC

#+RESULTS:
:   id weight1 glucagonAUC1 glucagonAUC2 glucagonAUC3 glucagonAUC4 male
: 1  1   127.2      5032.50       4942.5      20421.0      9249.45    1
: 2  2   165.2     12142.50      14083.5      10945.5      7612.50    0
: 3  3   109.7     10321.35       6202.5      20121.0     17704.50    1
: 4  4   146.2      6693.00       6631.5      13090.5      4551.00    0
: 5  5   113.1      7090.50           NA      19155.0     12345.00    1
: 6  6   158.8     10386.00       7609.5      11778.0      8014.80    0

Reshape data to long format:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(reshape2)
gastricbypassL <- melt(gastricbypassW,
                       id.vars = c("id","male","weight1"),
                       measure.var = paste0("glucagonAUC",1:4),
                       variable.name = "time", value.name = "glucagonAUC")
gastricbypassL$time <- gsub("glucagonAUC","",gastricbypassL$time)
gastricbypassL <- gastricbypassL[order(gastricbypassL$id),]
head(gastricbypassL)
#+END_SRC

#+RESULTS:
:    id male weight1 time glucagonAUC
: 1   1    1   127.2    1     5032.50
: 21  1    1   127.2    2     4942.50
: 41  1    1   127.2    3    20421.00
: 61  1    1   127.2    4     9249.45
: 2   2    0   165.2    1    12142.50
: 22  2    0   165.2    2    14083.50

#+BEGIN_SRC R :exports both :results silent :session *R* :cache no
ggSpa <- ggplot(gastricbypassL, aes(x=time, y=glucagonAUC, group=id))
ggSpa <- ggSpa + geom_point() + geom_line()
ggSpa
#+END_SRC

#+RESULTS:

#+ATTR_LaTeX: :width 1\textwidth :options trim={0 0 0 0} :placement [!h]
[[./figures/gg-spaghettiplot.pdf]]

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
ggsave(ggSpa, filename = "figures/gg-spaghettiplot.pdf", width = 5, height = 3)
#+END_SRC

#+RESULTS:
: Advarselsbesked:
: [1m[22mRemoved 2 rows containing missing values (`geom_point()`).


\clearpage

* My favorite approach

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eUN.lmm <- lmm(glucagonAUC ~ time + male + weight1,
         repetition = ~time | id, structure = "CS",
               data = gastricbypassL)
anova(eUN.lmm) 
#+END_SRC

#+RESULTS:
: 		Multivariate Wald test 
: 
:                  F-statistic       df p.value    
:    mean: time         14.752 (3,18.0) 4.3e-05 ***
:        : male          0.055 (1,11.6)   0.819    
:        : weight1       1.308 (1, 7.7)   0.287

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eUN.lmmPairwiseTest <- anova(eUN.lmm,
                effect = c("time2=0","time4=0","time4-time3=0"),
                           multivariate = FALSE)
summary(eUN.lmmPairwiseTest)
#+END_SRC

#+RESULTS:
#+begin_example
		Univariate Wald test 

                 estimate       se   df     lower     upper p.value    
   time2         -749.334  485.886 18.9 -2014.107   515.439 0.33716    
   time4         3202.583 1463.277   19  -606.366  7011.531 0.11308    
   time4 - time3 -6007.57  1157.98 16.9 -9021.821 -2993.319 0.00021 ***
   ------------------------------------------------------------------- 
  Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  Columns lower/upper/p.value adjusted for multiple comparisons -- max-test.
  (1e+05 samples have been used)
  Model-based standard errors are derived from the observed information (column se). 
  Degrees of freedom were computed using a Satterthwaite approximation (column df).
#+end_example

\clearpage

* Other approach: repeated measurement anova

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.ranova <- aov(formula = glucagonAUC ~ male + weight1 + time + Error(id),
                 data = gastricbypassL)
summary(e.ranova)
#+END_SRC

#+RESULTS:
#+begin_example

Error: id
          Df    Sum Sq   Mean Sq F value Pr(>F)  
male       1   1894331   1894331   0.065 0.8029  
weight1    1 115763362 115763362   3.943 0.0657 .
time       2   7936921   3968460   0.135 0.8746  
Residuals 15 440438932  29362595                 
---
Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1

Error: Within
          Df    Sum Sq   Mean Sq F value   Pr(>F)    
time       3 1.145e+09 381688003   21.77 2.02e-09 ***
Residuals 55 9.645e+08  17537102                     
---
Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1
#+end_example


#+BEGIN_SRC R :exports none :results output :session *R* :cache no
e.rmanova <- manova(cbind(glucagonAUC1,glucagonAUC2,glucagonAUC3,glucagonAUC4) ~ weight1 + male,
                    data = gastricbypassW)
summary(e.rmanova, test = "Wilks")
#+END_SRC

#+RESULTS:
:           Df   Wilks approx F num Df den Df  Pr(>F)  
: weight1    1 0.51418   2.8345      4     12 0.07235 .
: male       1 0.74952   1.0026      4     12 0.44375  
: Residuals 15                                         
: ---
: Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1

\clearpage

* Other approach: random intercept model
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.lmer <- lmer(glucagonAUC ~ time + male + weight1 + (1 | id),
              data = gastricbypassL)
anova(e.lmer)
#+END_SRC

#+RESULTS:
: Type III Analysis of Variance Table with Satterthwaite's method
:             Sum Sq   Mean Sq NumDF  DenDF F value    Pr(>F)    
: time    1148372460 382790820     3 56.107 21.9527 1.565e-09 ***
: male        802158    802158     1 17.281  0.0460   0.83268    
: weight1   77654552  77654552     1 17.045  4.4534   0.04991 *  
: ---
: Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1

Same as:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eCS.lmm <- lmm(glucagonAUC ~ time + male + weight1,
               repetition = ~time | id, structure = "CS",
               data = gastricbypassL)
anova(eCS.lmm) 

#+END_SRC

#+RESULTS:
: 		Multivariate Wald test 
: 
:                  F-statistic       df  p.value    
:    mean: time          21.95 (3,56.1) 1.57e-09 ***
:        : male          0.046 (1,17.3)   0.8327    
:        : weight1       4.453 (1,17.1)   0.0499   *

# @@latex:any arbitrary LaTeX code@@

